docs/tools/fio/230_fio_compare_os.out
default: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30
Starting 1 thread

default: (groupid=0, jobs=1): err= 0: pid=3136: Fri Jun  3 06:01:19 2022
  read: IOPS=1512, BW=6052KiB/s (6197kB/s)(41.4MiB/7001msec)
    slat (nsec): min=982, max=237340, avg=3871.82, stdev=5169.84
    clat (usec): min=354, max=1408, avg=656.57, stdev=121.79
     lat (usec): min=357, max=1411, avg=660.44, stdev=122.45
    clat percentiles (usec):
     |  1.00th=[  424],  5.00th=[  482], 10.00th=[  515], 20.00th=[  553],
     | 30.00th=[  586], 40.00th=[  611], 50.00th=[  644], 60.00th=[  676],
     | 70.00th=[  717], 80.00th=[  750], 90.00th=[  816], 95.00th=[  873],
     | 99.00th=[ 1004], 99.50th=[ 1057], 99.90th=[ 1172], 99.95th=[ 1221],
     | 99.99th=[ 1303]
   bw (  KiB/s): min= 4857, max= 6632, per=100.00%, avg=6053.86, stdev=597.38, samples=14
   iops        : min= 1214, max= 1658, avg=1513.43, stdev=149.37, samples=14
  lat (usec)   : 500=7.74%, 750=71.58%, 1000=19.67%
  lat (msec)   : 2=1.01%
  cpu          : usr=99.61%, sys=0.23%, ctx=1041, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10592,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6052KiB/s (6197kB/s), 6052KiB/s-6052KiB/s (6197kB/s-6197kB/s), io=41.4MiB (43.4MB), run=7001-7001msec