docs/tools/fio/230_fio_compare_os.out
default: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30
Starting 1 thread

default: (groupid=0, jobs=1): err= 0: pid=21185: Wed May 18 14:48:40 2022
  read: IOPS=1364, BW=5459KiB/s (5590kB/s)(37.3MiB/7001msec)
    slat (nsec): min=1012, max=248497, avg=4441.94, stdev=5567.30
    clat (usec): min=420, max=2810, avg=727.56, stdev=102.76
     lat (usec): min=423, max=2815, avg=732.00, stdev=103.16
    clat percentiles (usec):
     |  1.00th=[  510],  5.00th=[  578], 10.00th=[  611], 20.00th=[  644],
     | 30.00th=[  668], 40.00th=[  693], 50.00th=[  725], 60.00th=[  750],
     | 70.00th=[  775], 80.00th=[  807], 90.00th=[  848], 95.00th=[  889],
     | 99.00th=[ 1004], 99.50th=[ 1045], 99.90th=[ 1205], 99.95th=[ 1270],
     | 99.99th=[ 2802]
   bw (  KiB/s): min= 5330, max= 5544, per=100.00%, avg=5461.00, stdev=63.08, samples=14
   iops        : min= 1332, max= 1386, avg=1365.14, stdev=15.92, samples=14
  lat (usec)   : 500=0.77%, 750=58.90%, 1000=39.30%
  lat (msec)   : 2=1.00%, 4=0.02%
  cpu          : usr=99.29%, sys=0.57%, ctx=1184, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9555,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5459KiB/s (5590kB/s), 5459KiB/s-5459KiB/s (5590kB/s-5590kB/s), io=37.3MiB (39.1MB), run=7001-7001msec