docs/tools/fio/310_fio_compare_uspace.out


default: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30
Starting 1 thread

default: (groupid=0, jobs=1): err= 0: pid=3565: Fri Jun  3 06:01:41 2022
  read: IOPS=2092, BW=8372KiB/s (8573kB/s)(57.2MiB/7001msec)
    slat (usec): min=28, max=1661, avg=87.18, stdev=67.50
    clat (usec): min=34, max=14515, avg=388.71, stdev=256.92
     lat (usec): min=272, max=14610, avg=475.89, stdev=261.34
    clat percentiles (usec):
     |  1.00th=[  180],  5.00th=[  262], 10.00th=[  289], 20.00th=[  318],
     | 30.00th=[  343], 40.00th=[  363], 50.00th=[  383], 60.00th=[  400],
     | 70.00th=[  424], 80.00th=[  445], 90.00th=[  478], 95.00th=[  510],
     | 99.00th=[  594], 99.50th=[  644], 99.90th=[ 1270], 99.95th=[ 6063],
     | 99.99th=[12518]
   bw (  KiB/s): min= 7086, max= 9208, per=100.00%, avg=8374.79, stdev=560.80, samples=14
   iops        : min= 1771, max= 2302, avg=2093.64, stdev=140.28, samples=14
  lat (usec)   : 50=0.03%, 100=0.03%, 250=3.78%, 500=90.17%, 750=5.79%
  lat (usec)   : 1000=0.09%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.03%, 20=0.03%
  cpu          : usr=99.73%, sys=0.00%, ctx=753, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14653,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=8372KiB/s (8573kB/s), 8372KiB/s-8372KiB/s (8573kB/s-8573kB/s), io=57.2MiB (60.0MB), run=7001-7001msec