docs/tools/fio/310_fio_compare_uspace.out


default: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30
Starting 1 thread

default: (groupid=0, jobs=1): err= 0: pid=21614: Wed May 18 14:49:02 2022
  read: IOPS=1805, BW=7220KiB/s (7393kB/s)(49.4MiB/7001msec)
    slat (usec): min=36, max=3048, avg=133.60, stdev=116.65
    clat (usec): min=31, max=5284, avg=418.01, stdev=115.49
     lat (usec): min=338, max=8145, avg=551.61, stdev=136.81
    clat percentiles (usec):
     |  1.00th=[  176],  5.00th=[  249], 10.00th=[  289], 20.00th=[  343],
     | 30.00th=[  367], 40.00th=[  396], 50.00th=[  420], 60.00th=[  441],
     | 70.00th=[  469], 80.00th=[  498], 90.00th=[  537], 95.00th=[  578],
     | 99.00th=[  644], 99.50th=[  685], 99.90th=[  848], 99.95th=[ 1029],
     | 99.99th=[ 2900]
   bw (  KiB/s): min= 6736, max= 7576, per=100.00%, avg=7223.00, stdev=244.82, samples=14
   iops        : min= 1684, max= 1894, avg=1805.64, stdev=61.25, samples=14
  lat (usec)   : 50=0.18%, 100=0.25%, 250=4.61%, 500=75.98%, 750=18.72%
  lat (usec)   : 1000=0.20%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.01%
  cpu          : usr=99.61%, sys=0.03%, ctx=745, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=12637,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7220KiB/s (7393kB/s), 7220KiB/s-7220KiB/s (7393kB/s-7393kB/s), io=49.4MiB (51.8MB), run=7001-7001msec